Repository: adslbarxatov/FileExtensionsManager
Catalog: src/FileExtensionsManager_*.resx
Languages: ru_ru

# AppliedText
source: Applied:
ru_ru: Применены:

source: Apply all entries?
ru_ru: Применить все записи?

# ApplyAllEntries2
source: Has your decision changed?
ru_ru: Ваше решение изменилось?

# ApplyEntry
source: Apply selected entries?
ru_ru: Применить выбранные записи?

# BasesNotFound
source: No bases of registry entries found
ru_ru: Не найдена ни одна база реестровых записей

# ButtonsPanel_Apply
source: A&pply selected
ru_ru: &Применить выбранные

# ButtonsPanel_ApplyAll
source: Appl&y all
ru_ru: Применить &все

# ButtonsPanel_DeleteRecord
source: &Delete selected
ru_ru: &Удалить выбранные

# ButtonsPanel_FindIcon
source: Find &icon
ru_ru: Найти и&конку

# ButtonsPanel_LoadRegFile
source: &Load from file
ru_ru: &Загрузить из файла

# ButtonsPanel_RegExtension
source: &Register extension
ru_ru: Зарегистрировать &расширение

# ButtonsPanel_SaveRegFile
source: &Save to file
ru_ru: &Сохранить в файл

# EntriesAdded
source: Added:
ru_ru: Добавлено:

# EntriesApplied
source: Applied {0:D} from {1:D}
ru_ru: Применено {0:D} из {1:D}

# EntryIsIncorrect
source: Entry is incorrect. Make sure that path to registry key is correct, parameter name doesn’t contain the “\” character, and value matches the specified type, then try again
ru_ru: Запись некорректна. Убедитесь, что путь к разделу реестра корректен, имя параметра не содержит символ «\», а значение соответствует указанному типу, после чего повторите попытку

# EntryIsUnavailable
source: Entry cannot be applied: needed registry key is not available
ru_ru: Запись не может быть применена: раздел реестра недоступен

# EntryNotApplied
source: Cannot apply entry
ru_ru: Не удалось применить запись

# ER_OFDialogFilter
source: Executables|*.exe
ru_ru: Приложения|*.exe

# ER_OFDialogText
source: Select an application to open this file type
ru_ru: Выберите приложение для открытия этого типа файлов

# ER_Title
source: – extension registration
ru_ru: – регистрация расширения

# ExtensionRegFailed
source: Failed to create one or more entries to register the extension. Make sure that application has rights to work with the registry, then try again
ru_ru: Не удалось создать одну или несколько записей для регистрации расширения. Убедитесь, что у программы есть права для работы с реестром, после чего повторите попытку

# ExtensionRegistrator_AttentionLabel
source: Attention! Some applications may not support “Open with” command or support it in a non-standard way. In these cases, this function may not work correctly
ru_ru: Внимание! Некоторые приложения могут не поддерживать команду «Открыть с помощью» или поддерживать её нестандартным образом. В этих случаях данная функция может работать некорректно

# ExtensionRegistrator_ExecutableLabel
source: Executable for opening:
ru_ru: Открывающее приложение:

# ExtensionRegistrator_ExtensionLabel
source: File extension (without point):
ru_ru: Расширение файла (без точки):

# ExtensionRegistrator_IconLabel
source: File icon:
ru_ru: Значок файла:

# ExtensionRegistrator_TypeLabel
source: File type name:
ru_ru: Название типа файла:

# FEMF_OFDialogFilter
source: Windows registry file (*.reg)|*.reg
ru_ru: Файлы реестра Windows (*.reg)|*.reg

# FEMF_OFDialogTitle
source: Specify registry file for loading
ru_ru: Выберите файл реестра для загрузки

# FileExtensionsManagerForm_BaseLabel
source: Current &base:
ru_ru: Текущая &база:

# HelpText
source: Application allows you to store and apply custom settings for file extensions registered in the operating system. List of records displays registry mappings stored in currently selected base of records. Green indicates entries that already exist in Windows registry, blue indicates entries that partially correspond to user settings, and red indicates missing entries. If record is marked as deleted, then entries that are absent in registry are marked in green, otherwise they are marked in red. Presence of gray entries may indicate a lack of access to Windows registry. You can change the record by double-clicking on corresponding line, and add it using corresponding button. In both cases, information is edited in a special window, and their correctness is controlled by utility. You can also add entries from Windows registry file. You can apply entries one at a time or all at once (all that not applied). The “Exit” button saves all changes in all bases. If changes need to be undone, the application must be closed with a cross in the upper right corner of window. For now, utility only works with entries in registry branch HKEY_CLASSES_ROOT and only with parameter types REG_SZ, REG_DWORD, and REG_QWORD
ru_ru: Программа позволяет хранить и применять пользовательские настройки расширений файлов, зарегистрированных в операционной системе. В списке записей отображаются реестровые сопоставления, хранящиеся в текущей выбранной базе записей. Зелёным цветом обозначены записи, уже имеющиеся в реестре Windows, синим – записи, частично соответствующие пользовательским настройкам, а красным – отсутствующие записи. Если запись помечена как удаляемая, то зелёным помечаются отсутствующие в реестре записи, а красным – присутствующие. Наличие серых записей может говорить об отсутствии доступа к реестру Windows. Изменить запись можно по двойному щелчку мыши на соответствующей строке, добавить – с помощью соответствующей кнопки. В обоих случаях сведения редактируются в специальном окне, а их корректность контролируется утилитой. Добавить записи можно также и из файла реестра Windows. Применять записи можно по одной или все сразу (все неприменённые). Кнопка «Выход» сохраняет все изменения во всех базах. Если изменения нужно отменить, программу нужно закрыть крестиком в верхнем правом углу окна. На данный момент утилита работает только с записями в ветке реестра HKEY_CLASSES_ROOT и только с типами параметров REG_SZ, REG_DWORD и REG_QWORD

# IconsNotFound
source: File “{0:S}” contains no icons
ru_ru: Файл «{0:S}» не содержит значков

# IE_OFDialogFilter
source: Executables, libraries, assemblies, icons|*.ico;*.exe;*.dll;*.sfx;*.cpl|All files|*.*
ru_ru: Приложения, библиотеки, сборки, значки|*.ico;*.exe;*.dll;*.sfx;*.cpl|Все файлы|*.*

# IE_OFDialogTitle
source: Select file to view icons
ru_ru: Выберите файл для просмотра значков

# IE_PageLabel
source: Page:
ru_ru: Страница:

# IE_SelectButtonText
source: &Select #
ru_ru: &Выбрать №

# IE_Title
source: – icons view
ru_ru: – просмотр иконок

# IE_TotalLabelText
source: Total:
ru_ru: Всего:

# NewBaseAdded
source: Application will create an empty sample file. Give it a convenient name, then run the utility again
ru_ru: Программа создаст пустой файл-образец. Дайте ему удобное имя, после чего запустите утилиту снова

# NoAccessText
source: Unavailable:
ru_ru: Недоступны:

# NotAppliedText
source: Not applied:
ru_ru: Не применены:

# PartiallyAppliedText
source: Partially applied:
ru_ru: Применены частично:

# rebfile
source: Registry entries base file
ru_ru: Файл базы реестровых записей

# REE_Title
source: – entry creation
ru_ru: – добавление записи

# RegistryEntryEditor_EntryPath
source: Entry path:
ru_ru: Путь к разделу реестра:

# RegistryEntryEditor_NameMustBeDeleted
source: Parameter to be deleted
ru_ru: Удаляемый параметр

# RegistryEntryEditor_ParameterName
source: Parameter name:
ru_ru: Имя параметра:

# RegistryEntryEditor_ParameterType
source: Parameter type:
ru_ru: Тип параметра:

# RegistryEntryEditor_ParameterValue
source: Parameter value:
ru_ru: Значение параметра:

# RegistryEntryEditor_PathMustBeDeleted
source: Path to be deleted
ru_ru: Удаляемый раздел

# RegistryValue_Int32
source: (integer, 4 bytes)
ru_ru: (целочисленный, 4 байта)

# RegistryValue_Int64
source: (integer, 8 bytes)
ru_ru: (целочисленный, 8 байт)

# RegistryValue_String
source: (string)
ru_ru: (строковый)

# RemoveEntry
source: Remove selected entries?
ru_ru: Удалить выбранные записи?

# SomeFieldsAreEmpty
source: One of required fields is empty
ru_ru: Одно из обязательных полей не заполнено

# UnsupportedCharacter
source: File extension field contains invalid character [{0: S}]
ru_ru: Поле расширения файла содержит недопустимый символ [{0:S}]
